TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/DepartureBoardService/V1/DepartureBoardService_GetDepartureBoardTimeRequestType.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetDepartureBoardTimeRequestTypes xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.DepartureBoard.V1">
      <transactionId>GetDepartureBoardTimeRequestTypesTransactionId21212</transactionId>
      <language>en-GB</language>
    </GetDepartureBoardTimeRequestTypes>
  </soap:Body>
</soap:Envelope>