TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/DepartureBoardService/V1/LSE_NaPTANDepartureBoardService_GetDepartureBoard.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetDepartureBoard xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.DepartureBoard.V1">
      <transactionId>GetDepartureBoardTransactionId3123123</transactionId>
      <language>en-GB</language>
      <departureBoardRequest>
        <OriginLocation>
          <NaptanIds>
            <string>490001089E6</string>
          </NaptanIds>
          <Locality></Locality>
          <Code></Code>
          <Type>NAPTAN</Type>
          <Valid>true</Valid>
        </OriginLocation>
        <JourneyTimeInformation>
          <Type>TimeToday</Type>
          <Hour>20</Hour>
          <Minute>10</Minute>
        </JourneyTimeInformation>
        <RangeType>Sequence</RangeType>
        <Range>5</Range>
        <ShowDepartures>true</ShowDepartures>
        <ServiceNumber></ServiceNumber>
        <ShowCallingStops>false</ShowCallingStops>
      </departureBoardRequest>
    </GetDepartureBoard>
  </soap:Body>
</soap:Envelope>
